BGDP = 'БбПпГгДд'

LESSON_1 = {
    'А': '\u0531',  # Ա
    'а': '\u0561',  # ա
    'У': '\u0548\u0552',
    'у': '\u0578\u0582',
    'Б': '\u0532',
    'б': '\u0562',
    'П': '\u054A',
    'п': '\u057A',
    'Г': '\u0533',
    'г': '\u0563',
    'К': '\u053F',
    'к': '\u056F',
    'Д': '\u0534',
    'д': '\u0564',
    'Т': '\u054F',
    'т': '\u057F',
    'Р': '\u0550',
    'р': '\u0580',
    'Л': '\u053C',
    'л': '\u056C',
    'М': '\u0544',
    'м': '\u0574',
    'Н': '\u0546',
    'н': '\u0576',
}

LESSON_2 = {
    'И': '\u053B',
    'и': '\u056B',
    'Й': '\u0545',
    'й': '\u0575',
    'Х': '\u053D',
    'х': '\u056D',
    'Ш': '\u0547',
    'ш': '\u0577',
    'Ж': '\u053A',
    'ж': '\u056A',
    'Ч': '\u0549',
    'ч': '\u0579',
    'С': '\u054D',
    'с': '\u057D',
    'З': '\u0536',
    'з': '\u0566',
    'Ц': '\u0551',
    'ц': '\u0581',
    'Ф': '\u0556',
    'ф': '\u0586',
    'В': '\u054E',
    'в': '\u057E',
}

LESSON_3 = {
    'Э': '\u0537',  # 'Է'
    'э': '\u0567',  # 'է'
    'Е': '\u0535',  # 'Ե'
    'е': '\u0565',  # 'ե'
}

LESSON_4 = {
    'ев': '\u0587',  # 'և'
    'ВО': '\u0548',  # Ո
    'Во': '\u0548',  # Ո
    'во': '\u0578',  # ո
    'О+': '\u0555',  # 'Օ'
    'о+': '\u0585',  # 'օ'
    'О': '\u0548',  # Ո
    'о': '\u0578',  # ո
}

LESSON_5 = {
    'Х': '\u0540',  # Հ
    'х': '\u0570',  # հ
    'Г': '\u0542',  # 'Ղ'
    'г': '\u0572',  # 'ղ'
    'Р': '\u054c',  # Ռ
    'р': '\u057c',  # ռ
}

LESSON_6 = {
    'Ы': '\u0538',  # Ը
    'ы': '\u0568',  # ը
}

LESSON_7 = {
    'П': '\u0553',  # Փ
    'п': '\u0583',  # փ
}

LESSON_8 = {
    'К': '\u0554',  # Ք
    'к': '\u0584',  # ք
}

LESSON_9 = {
    'Т': '\u0539',  # Թ
    'т': '\u0569',  # թ
}

LESSON_10 = {
    'ДЗ': '\u0541',  # Ձ
    'Дз': '\u0541',  # Ձ
    'дз': '\u0571',  # ձ
    'ТЬ': '\u053e',  # Ծ
    'Ть': '\u053e',  # Ծ
    'ть': '\u056e',  # ծ
}

LESSON_11 = {
    'ДЖ': '\u054b',  # Ջ
    'Дж': '\u054b',  # Ջ
    'дж': '\u057b',  # ջ
    'Щ': '\u0543',  # Ճ ТШ
    'щ': '\u0573',  # ճ тш
}

VOWELS = {
    'А': '\u0531',  # Ա
    'а': '\u0561',  # ա
    'У': '\u0548\u0552',
    'у': '\u0578\u0582',
    'И': '\u053B',
    'и': '\u056B',
    'Э': '\u0537',  # 'Է'
    'э': '\u0567',  # 'է'
    'Е': '\u0535',  # 'Ե'
    'е': '\u0565',  # 'ե'
    'О+': '\u0555',  # 'Օ'
    'о+': '\u0585',  # 'օ'
    'О': '\u0548',  # Ո
    'о': '\u0578',  # ո
}

VOWELS_ADD_J = {
    'Я': '\u0545\u0531',
    'я': '\u0575\u0561',
    'Ё': '\u0545\u0548',
    'ё': '\u0575\u0578',
    'Ю': '\u0545\u0548\u0552',
    'ю': '\u0575\u0578\u0582',
}

VOWELS_ADD_VOEV = {
    'ев': '\u0587',  # 'և'
    'ВО': '\u0548',  # Ո
    'Во': '\u0548',  # Ո
    'во': '\u0578',  # ո
}

VOWELS_ADD_ = {
    'Ы': '\u0538',  # Ը
    'ы': '\u0568',  # ը
}

CONSONANTS = {
    'Б': '\u0532',
    'б': '\u0562',
    'П': '\u054A',
    'п': '\u057A',
    'Г': '\u0533',
    'г': '\u0563',
    'К': '\u053F',
    'к': '\u056F',
    'Д': '\u0534',
    'д': '\u0564',
    'Т': '\u054F',
    'т': '\u057F',
    'Р': '\u0550',
    'р': '\u0580',
    'Л': '\u053C',
    'л': '\u056C',
    'М': '\u0544',
    'м': '\u0574',
    'Н': '\u0546',
    'н': '\u0576',
    'Й': '\u0545',
    'й': '\u0575',
    'Х': '\u053D',
    'х': '\u056D',
    'Ш': '\u0547',
    'ш': '\u0577',
    'Ж': '\u053A',
    'ж': '\u056A',
    'Ч': '\u0549',
    'ч': '\u0579',
    'С': '\u054D',
    'с': '\u057D',
    'З': '\u0536',
    'з': '\u0566',
    'Ц': '\u0551',
    'ц': '\u0581',
    'Ф': '\u0556',
    'ф': '\u0586',
    'В': '\u054E',
    'в': '\u057E',
}

CONSONANTS_ALTR = {
    'Р': '\u054c',  # Ռ
    'р': '\u057c',  # ռ
}

CONSONANTS_ALTG = {
    'Г': '\u0542',  # 'Ղ'
    'г': '\u0572',  # 'ղ'
}

CONSONANTS_ALTH = {
    'Х': '\u0540',  # Հ
    'х': '\u0570',  # հ
}

CONSONANTS_ALTPKT = {
    'П': '\u0553',  # Փ
    'п': '\u0583',  # փ
    'К': '\u0554',  # Ք
    'к': '\u0584',  # ք
    'Т': '\u0539',  # Թ
    'т': '\u0569',  # թ
}

CONSONANTS_SOFTT = {
    'ТЬ': '\u053e',  # Ծ
    'Ть': '\u053e',  # Ծ
    'ть': '\u056e',  # ծ
}

CONSONANTS_DZS = {
    'ДЗ': '\u0541',  # Ձ
    'Дз': '\u0541',  # Ձ
    'дз': '\u0571',  # ձ
    'ДЖ': '\u054b',  # Ջ
    'Дж': '\u054b',  # Ջ
    'дж': '\u057b',  # ջ
}

CONSONANTS_TSCH = {
    'Щ': '\u0543',  # Ճ ТШ
    'щ': '\u0573',  # ճ тш
}

CONSONANTS_BOTH_RS = {
    'Р': '\u054c',  # Ռ
    'р': '\u057c',  # ռ
    'РЬ': '\u0550',
    'рь': '\u0580',
}

# Տտ перед гласными, Թթ перед согласными и в конце слова (аналогично с կ и պ)
# вполне возможно, что надо наоборот!
CONSONANTS_VOVEL_PKT = {
    'ТЪ': '\u054F',
    'тъ': '\u057F',
    'Т': '\u0539',  # Թ
    'т': '\u0569',  # թ
    'ПЪ': '\u054A',
    'пъ': '\u057A',
    'П': '\u0553',  # Փ
    'п': '\u0583',  # փ
    'КЪ': '\u053F',
    'къ': '\u056F',
    'К': '\u0554',  # Ք
    'к': '\u0584',  # ք
}


ARMENIAN_ALPHABET = {
    'Ա': '\u0531',
    'ա': '\u0561',
    'Բ': '\u0532',
    'բ': '\u0562',
    'Գ': '\u0533',
    'գ': '\u0563',
    'Դ': '\u0534',
    'դ': '\u0564',
    'Ե': '\u0535',
    'ե': '\u0565',
    'Զ': '\u0536',
    'զ': '\u0566',
    'Է': '\u0537',
    'է': '\u0567',
    'Ը': '\u0538',
    'ը': '\u0568',
    'Թ': '\u0539',
    'թ': '\u0569',
    'Ժ': '\u053a',
    'ժ': '\u056a',
    'Ի': '\u053b',
    'ի': '\u056b',
    'Լ': '\u053c',
    'լ': '\u056c',
    'Խ': '\u053d',
    'խ': '\u056d',
    'Ծ': '\u053e',
    'ծ': '\u056e',
    'Կ': '\u053f',
    'կ': '\u056f',
    'Հ': '\u0540',
    'հ': '\u0570',
    'Ձ': '\u0541',
    'ձ': '\u0571',
    'Ղ': '\u0542',
    'ղ': '\u0572',
    'Ճ': '\u0543',
    'ճ': '\u0573',
    'Մ': '\u0544',
    'մ': '\u0574',
    'Յ': '\u0545',
    'յ': '\u0575',
    'Ն': '\u0546',
    'ն': '\u0576',
    'Շ': '\u0547',
    'շ': '\u0577',
    'Ո': '\u0548',
    'ո': '\u0578',
    'Չ': '\u0549',
    'չ': '\u0579',
    'Պ': '\u054a',
    'պ': '\u057a',
    'Ջ': '\u054b',
    'ջ': '\u057b',
    'Ռ': '\u054c',
    'ռ': '\u057c',
    'Ս': '\u054d',
    'ս': '\u057d',
    'Վ': '\u054e',
    'վ': '\u057e',
    'Տ': '\u054f',
    'տ': '\u057f',
    'Ր': '\u0550',
    'ր': '\u0580',
    'Ց': '\u0551',
    'ց': '\u0581',
    'Ւ': '\u0552',
    'ւ': '\u0582',
    'Փ': '\u0553',
    'փ': '\u0583',
    'Ք': '\u0554',
    'ք': '\u0584',
    'և': '\u0587',
    'Օ': '\u0555',
    'օ': '\u0585',
    'Ֆ': '\u0556',
    'ֆ': '\u0586',
}


SETS = {
    'lesson_1': LESSON_1,
    'lesson_2': LESSON_2,
    'lesson_3': LESSON_3,
    'lesson_4': LESSON_4,
    'lesson_5': LESSON_5,
    'lesson_6': LESSON_6,
    'lesson_7': LESSON_7,
    'lesson_8': LESSON_8,
    'lesson_9': LESSON_9,
    'lesson_10': LESSON_10,
    'lesson_11': LESSON_11,
    'vowels': VOWELS,
    'vowels_j': VOWELS_ADD_J,
    'vowels_vojev': VOWELS_ADD_VOEV,
    'vowels_bI': VOWELS_ADD_,
    'consonants': CONSONANTS,
    'consonants_altr': CONSONANTS_ALTR,
    'consonants_altg': CONSONANTS_ALTG,
    'consonants_alth': CONSONANTS_ALTH,
    'consonants_altpkt': CONSONANTS_ALTPKT,
    'consonants_softt': CONSONANTS_SOFTT,
    'consonants_dzs': CONSONANTS_DZS,
    'consonants_tsch': CONSONANTS_TSCH,
    'consonants_both_rs': CONSONANTS_BOTH_RS,
    'consonants_vowel_pkt': CONSONANTS_VOVEL_PKT,

}

if __name__ == '__main__':
    a = []
    for key, value in CONSONANTS.items():
        a.append(value)
        # print(f"{value}")

    print(''.join(a))
